## Join Operations in dataframes
Pandas provides various facilities for easily combining together Series or DataFrame with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.In addition, pandas also provides utilities to compare two Series or DataFrame and summarize their differences.

https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [1]:
import pandas as pd
import numpy as np
df1 = pd.DataFrame({"key": ["K0", "K1", "K2", "K3"],"A": ["A0", "A1", "A2", "A3"],"B": ["B0", "B1", "B2", "B3"]})
df2 = pd.DataFrame({'key':['K0','K1','K2','K4'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [2]:
# inner join
pd.merge(df1,df2, on='key',how='inner')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [3]:
# left join
pd.merge(df1,df2, on='key',how='left')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2   C2   D2
3  K3  A3  B3  NaN  NaN

## Binary Operations in Data Frames
The binary operator function could perform addition, subtraction and so on to return the new value. Pandas.DataFrame has several binary operator functions defined for combining two DataFrames. The binary operator functions return a new DataFrame as a result of combining the two DataFrames.

In [4]:
# importing libraries
import pandas as pd
import numpy as np
df1 = pd.DataFrame([[2,3,5],[1,4,2],[2,7,5]])
df2 = pd.DataFrame([[3,2,5],[4,8,4],[1,6,7]])

In [5]:
# adding two dataframes
df1 + df2

   0   1   2
0  5   5  10
1  5  12   6
2  3  13  12

In [6]:
# subtracting two dataframes
df1 - df2

   0  1  2
0 -1  1  0
1 -3 -4 -2
2  1  1 -2

In [7]:
# multipliying two dataframes
df1 * df2

   0   1   2
0  6   6  25
1  4  32   8
2  2  42  35

In [8]:
# matrix multiplication
df1.dot(df2)

    0   1   2
0  23  58  57
1  21  46  35
2  39  90  73

In [9]:
# elementwise division
df1.div(df2)

          0         1         2
0  0.666667  1.500000  1.000000
1  0.250000  0.500000  0.500000
2  2.000000  1.166667  0.714286

In [10]:
# integer or floor division
# returns the quotient
df1.floordiv(df2)

   0  1  2
0  0  1  1
1  0  0  0
2  2  1  0

In [11]:
# modular division
# returns the remainder
df1.mod(df2)

   0  1  2
0  2  1  0
1  1  4  2
2  0  1  5

In [12]:
# pow() function to a dataframe
df1.pow(df2)

   0       1      2
0  8       9   3125
1  1   65536     16
2  2  117649  78125

In [13]:
# lt() function
df1.lt(df2)

       0      1      2
0   True  False  False
1   True   True   True
2  False  False   True

## Binary Operations on series
We can perform binary operation on series like addition, subtraction and many other operation. In order to perform binary operation on series we have to use some function like .add(),.sub() etc..

In [14]:
# importing pandas
import pandas as pd
# creating two pandas series
s1 = pd.Series([2,4,6,1,6,0])
s2 = pd.Series([5,1,7,4,2,3])

In [15]:
s1 + s2

0     7
1     5
2    13
3     5
4     8
5     3
dtype: int64

In [16]:
# adding two series using the add() function
s1.add(s2)

0     7
1     5
2    13
3     5
4     8
5     3
dtype: int64

In [17]:
s1 - s2

0   -3
1    3
2   -1
3   -3
4    4
5   -3
dtype: int64

In [18]:
# subtracting two series using the sub() function
s1.sub(s2)

0   -3
1    3
2   -1
3   -3
4    4
5   -3
dtype: int64

In [19]:
# multiplying two series using the mul() function
s1.mul(s2)

0    10
1     4
2    42
3     4
4    12
5     0
dtype: int64

In [20]:
s1 * s2

0    10
1     4
2    42
3     4
4    12
5     0
dtype: int64